Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/spi.h
/* -------- SPI_RDR : (SPI Offset: 0x08) ( R/ 32) Receive Data Register -------- */
#define SPI_RDR_RD_Pos                        _UINT32_(0)                                          /* (SPI_RDR) Receive Data Position */
#define SPI_RDR_RD_Msk                        (_UINT32_(0xFFFF) << SPI_RDR_RD_Pos)                 /* (SPI_RDR) Receive Data Mask */
#define SPI_RDR_RD(value)                     (SPI_RDR_RD_Msk & (_UINT32_(value) << SPI_RDR_RD_Pos)) /* Assignment of value for RD in the SPI_RDR register */
#define SPI_RDR_PCS_Pos                       _UINT32_(16)                                         /* (SPI_RDR) Peripheral Chip Select Position */
#define SPI_RDR_PCS_Msk                       (_UINT32_(0xF) << SPI_RDR_PCS_Pos)                   /* (SPI_RDR) Peripheral Chip Select Mask */
#define SPI_RDR_PCS(value)                    (SPI_RDR_PCS_Msk & (_UINT32_(value) << SPI_RDR_PCS_Pos)) /* Assignment of value for PCS in the SPI_RDR register */
#define SPI_RDR_Msk                           _UINT32_(0x000FFFFF)                                 /* (SPI_RDR) Register Mask  */


/* -------- SPI_TDR : (SPI Offset: 0x0C) ( /W 32) Transmit Data Register -------- */
#define SPI_TDR_TD_Pos                        _UINT32_(0)                                          /* (SPI_TDR) Transmit Data Position */
#define SPI_TDR_TD_Msk                        (_UINT32_(0xFFFF) << SPI_TDR_TD_Pos)                 /* (SPI_TDR) Transmit Data Mask */
#define SPI_TDR_TD(value)                     (SPI_TDR_TD_Msk & (_UINT32_(value) << SPI_TDR_TD_Pos)) /* Assignment of value for TD in the SPI_TDR register */
#define SPI_TDR_PCS_Pos                       _UINT32_(16)                                         /* (SPI_TDR) Peripheral Chip Select Position */
#define SPI_TDR_PCS_Msk                       (_UINT32_(0xF) << SPI_TDR_PCS_Pos)                   /* (SPI_TDR) Peripheral Chip Select Mask */
#define SPI_TDR_PCS(value)                    (SPI_TDR_PCS_Msk & (_UINT32_(value) << SPI_TDR_PCS_Pos)) /* Assignment of value for PCS in the SPI_TDR register */
#define   SPI_TDR_PCS_NPCS0_Val               _UINT32_(0xE)                                        /* (SPI_TDR) NPCS0 as Chip Select  */
#define   SPI_TDR_PCS_NPCS1_Val               _UINT32_(0xD)                                        /* (SPI_TDR) NPCS1 as Chip Select  */
#define   SPI_TDR_PCS_NPCS2_Val               _UINT32_(0xB)                                        /* (SPI_TDR) NPCS2 as Chip Select  */
#define   SPI_TDR_PCS_NPCS3_Val               _UINT32_(0x7)                                        /* (SPI_TDR) NPCS3 as Chip Select  */
#define SPI_TDR_PCS_NPCS0                     (SPI_TDR_PCS_NPCS0_Val << SPI_TDR_PCS_Pos)           /* (SPI_TDR) NPCS0 as Chip Select Position */
#define SPI_TDR_PCS_NPCS1                     (SPI_TDR_PCS_NPCS1_Val << SPI_TDR_PCS_Pos)           /* (SPI_TDR) NPCS1 as Chip Select Position */
#define SPI_TDR_PCS_NPCS2                     (SPI_TDR_PCS_NPCS2_Val << SPI_TDR_PCS_Pos)           /* (SPI_TDR) NPCS2 as Chip Select Position */
#define SPI_TDR_PCS_NPCS3                     (SPI_TDR_PCS_NPCS3_Val << SPI_TDR_PCS_Pos)           /* (SPI_TDR) NPCS3 as Chip Select Position */
#define SPI_TDR_LASTXFER_Pos                  _UINT32_(24)                                         /* (SPI_TDR) Last Transfer Position */
#define SPI_TDR_LASTXFER_Msk                  (_UINT32_(0x1) << SPI_TDR_LASTXFER_Pos)              /* (SPI_TDR) Last Transfer Mask */
#define SPI_TDR_LASTXFER(value)               (SPI_TDR_LASTXFER_Msk & (_UINT32_(value) << SPI_TDR_LASTXFER_Pos)) /* Assignment of value for LASTXFER in the SPI_TDR register */
#define SPI_TDR_Msk                           _UINT32_(0x010FFFFF)                                 /* (SPI_TDR) Register Mask  */


/* -------- SPI_SR : (SPI Offset: 0x10) ( R/ 32) Status Register -------- */
#define SPI_SR_RDRF_Pos                       _UINT32_(0)                                          /* (SPI_SR) Receive Data Register Full (cleared by reading SPI_RDR) Position */
#define SPI_SR_RDRF_Msk                       (_UINT32_(0x1) << SPI_SR_RDRF_Pos)                   /* (SPI_SR) Receive Data Register Full (cleared by reading SPI_RDR) Mask */
#define SPI_SR_RDRF(value)                    (SPI_SR_RDRF_Msk & (_UINT32_(value) << SPI_SR_RDRF_Pos)) /* Assignment of value for RDRF in the SPI_SR register */
#define SPI_SR_TDRE_Pos                       _UINT32_(1)                                          /* (SPI_SR) Transmit Data Register Empty (cleared by writing SPI_TDR) Position */
#define SPI_SR_TDRE_Msk                       (_UINT32_(0x1) << SPI_SR_TDRE_Pos)                   /* (SPI_SR) Transmit Data Register Empty (cleared by writing SPI_TDR) Mask */
#define SPI_SR_TDRE(value)                    (SPI_SR_TDRE_Msk & (_UINT32_(value) << SPI_SR_TDRE_Pos)) /* Assignment of value for TDRE in the SPI_SR register */
#define SPI_SR_MODF_Pos                       _UINT32_(2)                                          /* (SPI_SR) Mode Fault Error (cleared on read) Position */
#define SPI_SR_MODF_Msk                       (_UINT32_(0x1) << SPI_SR_MODF_Pos)                   /* (SPI_SR) Mode Fault Error (cleared on read) Mask */
#define SPI_SR_MODF(value)                    (SPI_SR_MODF_Msk & (_UINT32_(value) << SPI_SR_MODF_Pos)) /* Assignment of value for MODF in the SPI_SR register */
#define SPI_SR_OVRES_Pos                      _UINT32_(3)                                          /* (SPI_SR) Overrun Error Status (cleared on read) Position */
#define SPI_SR_OVRES_Msk                      (_UINT32_(0x1) << SPI_SR_OVRES_Pos)                  /* (SPI_SR) Overrun Error Status (cleared on read) Mask */
#define SPI_SR_OVRES(value)                   (SPI_SR_OVRES_Msk & (_UINT32_(value) << SPI_SR_OVRES_Pos)) /* Assignment of value for OVRES in the SPI_SR register */
#define SPI_SR_NSSR_Pos                       _UINT32_(8)                                          /* (SPI_SR) NSS Rising (cleared on read) Position */
#define SPI_SR_NSSR_Msk                       (_UINT32_(0x1) << SPI_SR_NSSR_Pos)                   /* (SPI_SR) NSS Rising (cleared on read) Mask */
#define SPI_SR_NSSR(value)                    (SPI_SR_NSSR_Msk & (_UINT32_(value) << SPI_SR_NSSR_Pos)) /* Assignment of value for NSSR in the SPI_SR register */
#define SPI_SR_TXEMPTY_Pos                    _UINT32_(9)                                          /* (SPI_SR) Transmission Registers Empty (cleared by writing SPI_TDR) Position */
#define SPI_SR_TXEMPTY_Msk                    (_UINT32_(0x1) << SPI_SR_TXEMPTY_Pos)                /* (SPI_SR) Transmission Registers Empty (cleared by writing SPI_TDR) Mask */
#define SPI_SR_TXEMPTY(value)                 (SPI_SR_TXEMPTY_Msk & (_UINT32_(value) << SPI_SR_TXEMPTY_Pos)) /* Assignment of value for TXEMPTY in the SPI_SR register */
#define SPI_SR_UNDES_Pos                      _UINT32_(10)                                         /* (SPI_SR) Underrun Error Status (Slave mode only) (cleared on read) Position */
#define SPI_SR_UNDES_Msk                      (_UINT32_(0x1) << SPI_SR_UNDES_Pos)                  /* (SPI_SR) Underrun Error Status (Slave mode only) (cleared on read) Mask */
#define SPI_SR_UNDES(value)                   (SPI_SR_UNDES_Msk & (_UINT32_(value) << SPI_SR_UNDES_Pos)) /* Assignment of value for UNDES in the SPI_SR register */
#define SPI_SR_SPIENS_Pos                     _UINT32_(16)                                         /* (SPI_SR) SPI Enable Status Position */
#define SPI_SR_SPIENS_Msk                     (_UINT32_(0x1) << SPI_SR_SPIENS_Pos)                 /* (SPI_SR) SPI Enable Status Mask */
#define SPI_SR_SPIENS(value)                  (SPI_SR_SPIENS_Msk & (_UINT32_(value) << SPI_SR_SPIENS_Pos)) /* Assignment of value for SPIENS in the SPI_SR register */
#define SPI_SR_Msk                            _UINT32_(0x0001070F)                                 /* (SPI_SR) Register Mask  */


/* -------- SPI_IER : (SPI Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define SPI_IER_RDRF_Pos                      _UINT32_(0)                                          /* (SPI_IER) Receive Data Register Full Interrupt Enable Position */
#define SPI_IER_RDRF_Msk                      (_UINT32_(0x1) << SPI_IER_RDRF_Pos)                  /* (SPI_IER) Receive Data Register Full Interrupt Enable Mask */
#define SPI_IER_RDRF(value)                   (SPI_IER_RDRF_Msk & (_UINT32_(value) << SPI_IER_RDRF_Pos)) /* Assignment of value for RDRF in the SPI_IER register */
#define SPI_IER_TDRE_Pos                      _UINT32_(1)                                          /* (SPI_IER) SPI Transmit Data Register Empty Interrupt Enable Position */
#define SPI_IER_TDRE_Msk                      (_UINT32_(0x1) << SPI_IER_TDRE_Pos)                  /* (SPI_IER) SPI Transmit Data Register Empty Interrupt Enable Mask */
#define SPI_IER_TDRE(value)                   (SPI_IER_TDRE_Msk & (_UINT32_(value) << SPI_IER_TDRE_Pos)) /* Assignment of value for TDRE in the SPI_IER register */
#define SPI_IER_MODF_Pos                      _UINT32_(2)                                          /* (SPI_IER) Mode Fault Error Interrupt Enable Position */
#define SPI_IER_MODF_Msk                      (_UINT32_(0x1) << SPI_IER_MODF_Pos)                  /* (SPI_IER) Mode Fault Error Interrupt Enable Mask */
#define SPI_IER_MODF(value)                   (SPI_IER_MODF_Msk & (_UINT32_(value) << SPI_IER_MODF_Pos)) /* Assignment of value for MODF in the SPI_IER register */
#define SPI_IER_OVRES_Pos                     _UINT32_(3)                                          /* (SPI_IER) Overrun Error Interrupt Enable Position */
#define SPI_IER_OVRES_Msk                     (_UINT32_(0x1) << SPI_IER_OVRES_Pos)                 /* (SPI_IER) Overrun Error Interrupt Enable Mask */
#define SPI_IER_OVRES(value)                  (SPI_IER_OVRES_Msk & (_UINT32_(value) << SPI_IER_OVRES_Pos)) /* Assignment of value for OVRES in the SPI_IER register */
#define SPI_IER_NSSR_Pos                      _UINT32_(8)                                          /* (SPI_IER) NSS Rising Interrupt Enable Position */
#define SPI_IER_NSSR_Msk                      (_UINT32_(0x1) << SPI_IER_NSSR_Pos)                  /* (SPI_IER) NSS Rising Interrupt Enable Mask */
#define SPI_IER_NSSR(value)                   (SPI_IER_NSSR_Msk & (_UINT32_(value) << SPI_IER_NSSR_Pos)) /* Assignment of value for NSSR in the SPI_IER register */
#define SPI_IER_TXEMPTY_Pos                   _UINT32_(9)                                          /* (SPI_IER) Transmission Registers Empty Enable Position */
#define SPI_IER_TXEMPTY_Msk                   (_UINT32_(0x1) << SPI_IER_TXEMPTY_Pos)               /* (SPI_IER) Transmission Registers Empty Enable Mask */
#define SPI_IER_TXEMPTY(value)                (SPI_IER_TXEMPTY_Msk & (_UINT32_(value) << SPI_IER_TXEMPTY_Pos)) /* Assignment of value for TXEMPTY in the SPI_IER register */
#define SPI_IER_UNDES_Pos                     _UINT32_(10)                                         /* (SPI_IER) Underrun Error Interrupt Enable Position */
#define SPI_IER_UNDES_Msk                     (_UINT32_(0x1) << SPI_IER_UNDES_Pos)                 /* (SPI_IER) Underrun Error Interrupt Enable Mask */
#define SPI_IER_UNDES(value)                  (SPI_IER_UNDES_Msk & (_UINT32_(value) << SPI_IER_UNDES_Pos)) /* Assignment of value for UNDES in the SPI_IER register */
#define SPI_IER_Msk                           _UINT32_(0x0000070F)                                 /* (SPI_IER) Register Mask  */


